[{"type": "CompositeElement", "element_id": "cc096d41bebb753037335b3bd8869f04", "text": "Lookup Filter Label Mappings & Custom Metadata Types\n\nLookup Filter Label Mappings allow organizations to specify the lookup filters and alternate fields to be displayed in lookup dropdowns on lightning components or related downloaded templates. This is done by specifying the lookup filter criteria in a new Custom Metadata Type (CMDT) named xx_Lookup_Filter_Label_Mapping_mdt.\n\nHere are the LWCs and the their related offline templates where this is relevant:\n\nmanageIndicators\n\nmanageLogFrames\n\nactivities\n\nFinancials Excel Upload\n\nFinancials Excel Download", "metadata": {"page_number": 1, "languages": ["eng"], "filename": "Lookup+Filter+Label+Mappings+&+Custom+Metadata+Types (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "3f9da36331a25f611fb687a321c4a13a", "text": "Configure lookup filter criterias:\n\nTo add a new record for customization, navigate to “Setup” in the Quick Find box and enter “Custom Metadata Types”.\n\nClick on “Manage Records” to the left of the ampi__xx_Lookup_Filter_Label_Mapping__mdt CMDT.\n\nPopulate the new record as follows:\n\nLabel - Specify the label for this record to help identify what this record does e.g. Parent Activity on Add Activity Modal\n\nSource Component (Picklist) - Choose the component you want to apply the Label/ Filter to. It determines the component on which this custom metadata record works. e.g. Activity Add Popup\n\nChild Object Name: The API name of the object on which the lookup field exists, e.g. ampi__Activity__c\n\nParent Object Name: The API name of the parent object in the lookup relationship, e.g. ampi__Activity__c.\n\nLookup Field Name: The API name of the lookup field, e.g. ampi__Parent_Activity__c.\n\nLabel Field on the Parent Object: The API name of the field to be displayed in the lookup dropdown, e.g. ampi__Label_Translated__c.", "metadata": {"emphasized_text_contents": ["Configure lookup filter criterias:"], "emphasized_text_tags": ["b"], "page_number": 1, "languages": ["eng"], "filename": "Lookup+Filter+Label+Mappings+&+Custom+Metadata+Types (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "15f06c2c2bc17df11a9db3ed7a36703b", "text": "Filter Condition: Define the filter criteria that should be used to show filtered values in the lookup dropdown (or the relevant column in the downloaded template). Accepted filter operators are as follows:\n\nData Type Operator Label Operator Value Phone EQUALS = NOTEQUALS != CONTAINS LIKE NOTCONTAINS NOT LIKE Text Picklist EQUALS = NOTEQUALS != CONTAINS LIKE NOTCONTAINS NOT LIKE Date, Number, Currency, Percent EQUALS = NOTEQUALS != LESSTHAN < GREATERTHAN > LESSTHANEQUAL <= GREATERTHANEQUAL >=\n\nThe following types of filter conditions are supported:\n\nOperator(Parent_Field_API, VALUE(Constant Value))\n\nOperator(Parent_Field_API, FIELD(Child_Field_API))\n\nIn the Add and Edit pop up modals, when using the operators LESSTHAN, GREATERTHAN, LESSTHANEQUAL, or GREATERTHANEQUAL with a Field-type filter, the field must be included in the modal and must contain a value. In the case of Value-type filter it works fine, irrespective.", "metadata": {"emphasized_text_contents": ["Data Type", "Operator Label", "Operator Value"], "emphasized_text_tags": ["b", "b", "b"], "page_number": 1, "text_as_html": "<table><tr><td>Data Type</td><td>Operator Label</td><td>Operator Value</td></tr><tr><td>Phone</td><td>EQUALS</td><td>=</td></tr><tr><td>Phone</td><td>NOTEQUALS</td><td>!=</td></tr><tr><td>Phone</td><td>CONTAINS</td><td>LIKE</td></tr><tr><td>Phone</td><td>NOTCONTAINS</td><td>NOT LIKE</td></tr><tr><td>Text Picklist</td><td>EQUALS</td><td>=</td></tr><tr><td>Text Picklist</td><td>NOTEQUALS</td><td>!=</td></tr><tr><td>Text Picklist</td><td>CONTAINS</td><td>LIKE</td></tr><tr><td>Text Picklist</td><td>NOTCONTAINS</td><td>NOT LIKE</td></tr><tr><td>Date, Number, Currency, Percent</td><td>EQUALS</td><td>=</td></tr><tr><td>Date, Number, Currency, Percent</td><td>NOTEQUALS</td><td>!=</td></tr><tr><td>Date, Number, Currency, Percent</td><td>LESSTHAN</td><td>&lt;</td></tr><tr><td>Date, Number, Currency, Percent</td><td>GREATERTHAN</td><td>&gt;</td></tr><tr><td>Date, Number, Currency, Percent</td><td>LESSTHANEQUAL</td><td>&lt;=</td></tr><tr><td>Date, Number, Currency, Percent</td><td>GREATERTHANEQUAL</td><td>&gt;=</td></tr></table>", "languages": ["eng"], "filename": "Lookup+Filter+Label+Mappings+&+Custom+Metadata+Types (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "bbfae78653f117186d215eed81e7cdbd", "text": "The Filter Condition field follows a specific formatting. Supported condition types include:\n\nAND Condition: AND(Condition1;Condition2) Example: AND(EQUALS(Type, FIELD(Account.Type)); EQUALS(Status, FIELD(Account.Status))) The dropdown will only show those Accounts whose value matches with both the child Account Type and Status.\n\nOR Condition: OR(Condition1;Condition2) Example: OR(EQUALS(Type, FIELD(Account.Type)); EQUALS(Status, FIELD(Account.Status))) The dropdown will only show those Accounts whose value matches with either the child Account Type or Status.\n\nConditions should be separated by a semicolon (;).\n\nSimple Condition: Neither AND nor OR. Example: EQUALS(Name, VALUE(Acc1))\n\nThe dropdown will only show those Accounts whose name is “Acc1”\n\nClick ‘Save’.\n\nIn Label Field on the Parent Object: xx_Child_Label_Name__c, please enter the API name using a supported data type. Supported Data Types include:\n\nEmail\n\nPhone\n\nPicklist\n\nText\n\nText Area\n\nURL\n\nLookup", "metadata": {"page_number": 1, "languages": ["eng"], "filename": "Lookup+Filter+Label+Mappings+&+Custom+Metadata+Types (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "730e53637098e625876b07dea0bf4ec8", "text": "If there are no records with a value in the field specified by the Label Field on the Parent Object, those records won’t appear in the results. Only records with a value in the field defined by the Label Field API Name will be displayed.", "metadata": {"page_number": 2, "languages": ["eng"], "filename": "Lookup+Filter+Label+Mappings+&+Custom+Metadata+Types (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "e6829908b483a2dc0b2361885785a2b1", "text": "Filter Validation and Limitations\n\nPhone Data Type: Values must be passed in an unformatted way (e.g., 1234567891), but will be displayed as formatted (123) 456-7891.\n\nDate Data Type: Values must follow the YYYY-MM-DD format.\n\nCurrency and Number Fields: If no value is provided during add/edit operations, the system defaults to 0 for comparisons.\n\nDate Fields: If no value is entered, the system treats it as null during comparisons.\n\nWhen using the Download/Upload template, only fields from the host object can be used as reference fields in filter criteria. e.g. When downloading Activities from the Implementation Plan record page, only fields from the Implementation Plan can be used as reference fields.\n\nWhen working with standard objects, we can directly use the object’s API name in the filter condition followed by .[FieldName] for performing comparisons.\n\ne.g. Enter Account.Type or Account.ID as part of the filter condition to compare Account Type or Account ID.", "metadata": {"link_texts": ["Account.ID"], "link_urls": ["http://Account.ID"], "page_number": 2, "languages": ["eng"], "filename": "Lookup+Filter+Label+Mappings+&+Custom+Metadata+Types (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "408fc48807bdde158524213c606425f0", "text": "When working with custom objects, we replace __c with __r followed by .[FieldName] for performing comparisons.\n\ne.g. Enter CustomObject_r.Name as part of the filter condition to compare the Custom Object’s Name.\n\nWhen the Source Component is set to \"Filters,\" the lookup dropdown will show relevant fields as labels, but users won't be able to filter the options.\n\nLookup Filter Label Mappings available on Amp Impact out of the Box:", "metadata": {"page_number": 2, "languages": ["eng"], "filename": "Lookup+Filter+Label+Mappings+&+Custom+Metadata+Types (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "178222a8babd99cfdff817d4c051ebd1", "text": "Users can edit only the IsActive field and the Filter Condition for these records, they cannot modify the remaining fields.\n\nWhen would you see an error:\n\nInvalid Filter: An error is raised if the filter conditions are incorrect.\n\nAPI Errors: Errors occur if any API referenced in the filter is unavailable.\n\nField Access Issues: If there is no access to a specified field in the filter, it will trigger an error.\n\nLWC Components: If one filter fails, the default values will display, ignoring all other valid filters.\n\nDownload/Upload: If one filter fails, the remaining valid filters are still applied to their respective lookups.", "metadata": {"emphasized_text_contents": ["When would you see an error:"], "emphasized_text_tags": ["b"], "page_number": 2, "languages": ["eng"], "filename": "Lookup+Filter+Label+Mappings+&+Custom+Metadata+Types (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "0fc5c156b6caf520307befafc01c6461", "text": "Add Results\n\nThis page covers:\n\nOverview of Results in Amp Impact\n\nAdd Results Page Options: Visualforce Page vs. Lightning Web Component\n\nAdd Results for Project Indicators using the Lightning Web Component LIGHTNING WEB COMPONENT\n\nCompare Results Data with Target or Baseline Data LIGHTNING WEB COMPONENT\n\nEnter Result Values For Project Indicators LIGHTNING WEB COMPONENT\n\nMark Results as Not Applicable LIGHTNING WEB COMPONENT\n\nIndicator Performance Stoplights LIGHTNING WEB COMPONENT\n\nUpload Documents LIGHTNING WEB COMPONENT\n\nSubmit Results for Review LIGHTNING WEB COMPONENT\n\nMultiple Users Making Updates Simultaneously: Refresh the Add Results Component LIGHTNING WEB COMPONENT\n\nAdd Results for Project Indicators using the Visualforce Page VISUALFORCE PAGE\n\nEnter Result Values For Project Indicators VISUALFORCE PAGE\n\nIndicator Performance Stoplights VISUALFORCE PAGE\n\nUpload Documents VISUALFORCE PAGE\n\nSubmit Result for Review VISUALFORCE PAGE", "metadata": {"page_number": 1, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "21d1a632dc65dc4c45a0a0b2af0e87eb", "text": "Overview of Results in Amp Impact\n\nResults track the progress on Project Indicators. Often, organizations compare Results data to Target or Baseline data values by Project Indicator.\n\nDepending on an organization's impact measurement processes, they can enter Results by Project Indicator for different timeframes (Reporting Periods) and locations (Geographic Areas).", "metadata": {"page_number": 1, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "f8d4f897ce560834b89f79309b884f15", "text": "Add Results Page Options: Visualforce Page vs. Lightning Web Component\n\nAs with Frameworks and Indicator pages, Amp Impact comes with two options for displaying and managing Indicator data: Visualforce and Lightning Web Component. Depending on which option your organization uses, you would need to navigate to different sections of this guide to ensure the steps outlined here corresponds with what you’ll see in your system. Check with your System Administrator if you’re unsure which option you are using.\n\nDescription VISUALFORCE PAGE LIGHTNING WEB COMPONENT Add Results for Aggregated and calculated Indicators Compare Results with Baseline values Add Results for Picklist Indicators. Add Results for Read-Only Indicators Configurable Comment Pop-Up Display deactivated Reporting Periods on the Add Results page. Add Results for Numerator/Denominator Indicators", "metadata": {"emphasized_text_contents": ["VISUALFORCE PAGE", "LIGHTNING WEB COMPONENT"], "emphasized_text_tags": ["b", "b"], "page_number": 1, "text_as_html": "<table><tr><td>Description</td><td>VISUALFORCE PAGE</td><td>LIGHTNING WEB COMPONENT</td></tr><tr><td>Add Results for Aggregated and calculated Indicators</td><td/><td/></tr><tr><td>Compare Results with Baseline values</td><td/><td/></tr><tr><td>Add Results for Picklist Indicators.</td><td/><td/></tr><tr><td>Add Results for Read-Only Indicators</td><td/><td/></tr><tr><td>Configurable Comment Pop-Up</td><td/><td/></tr><tr><td>Display deactivated Reporting Periods on the Add Results page.</td><td/><td/></tr><tr><td>Add Results for Numerator/Denominator Indicators</td><td/><td/></tr></table>", "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "b22529b9aafac2294e1689be85d98724", "text": "Add Results for Project Indicators using the Lightning Web Component LIGHTNING WEB COMPONENT\n\nBefore you can add Results for your Project Indicators, there are a couple of Project setup-related tasks to complete:\n\nSet project-specific Reporting Periods\n\nCreate Geographic Area records\n\nSet up Project Indicators\n\nIf any of these elements are missing, you’ll get a message saying: “The Project is not linked to at least one Project Indicator for a Reporting Period and Geographic Area.”\n\nSystem Admin Note: Ensure that Disaggregated Project Indicator records have been created. If Disaggregated Project Indicator records are missing, you’ll get an error message saying “Something Went Wrong”.\n\nHere is a screenshot of what you’ll see if the data setup is done correctly: When the Add Results table is loaded, the “Reporting Period” and “Geographic Area” dropdowns have default values selected. The Project Indicators corresponding to these selections are displayed on the Add Results table.", "metadata": {"link_texts": ["Set project-specific Reporting Periods", "Create Geographic Area records"], "link_urls": ["file:///C:\\wiki\\spaces\\AIEP\\pages\\3653763073\\Reporting+Periods+Create+Assign+Reporting+Periods+for+your+Project", "file:///C:\\wiki\\spaces\\AIEP\\pages\\3678011393\\Project+Geographic+Areas+Assign+Geographic+Areas+to+your+Project"], "page_number": 2, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "bdeacb9f7d63f2538d27836f13c84608", "text": "Details. Setup. Activities Financials Framework Risk Indicators, Targets Results. Performance Graphs Files More Reporting Period Geographic Area Compare with 2023 Iharkand Target © sumit <] Search ¥ Show tore Fiters PROJECT INDICATOR TARGET ResuLT #0f food packets distributed 100 125 #ofteachers trainad on nutiion 250 20\n\nSelect a “Reporting Period” that you want to enter Result values for from the dropdown. Only Reporting Periods that are related to Project Indicators will be displayed in this list. The first Reporting Period is selected by default so remember to check and update the Reporting Period value if you’re adding Results for another period.", "metadata": {"page_number": 3, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "a2a963be770e5c719e33bb665d2eb64f", "text": "Select a “Geographic Area” that you want to enter Target values for. Only Geographic Areas that are marked as “Active” will be available. Results can only be set for one location at a time. The first value in the list of Geographic Areas is selected by default so remember to check and update the Geographic Area value if you’re setting Results for another area.\n\nSelect from “Baseline” or “Targets” in the “Compare With” dropdown. It allows you to compare Results with either Targets or Baseline values set for project Indicators. Read more about it here.\n\nThe list of available Project Indicators that are related to the selected Reporting Periods and Geographic Areas will be displayed in the Add Results table. the indicator would be available for reporting on AddResults LWC irrespective of the Data Track field value.\n\nProject Indicators will be available for reporting only when the Data Track field is set to either “Results” or “Targets and Results”.", "metadata": {"link_texts": ["here"], "link_urls": ["https://verasolutions.atlassian.net/wiki/spaces/AIEP/pages/3732406327/Add+Results#Compare-Results-Data-with-Target-or-Baseline-Data-Lightning-Web-Component"], "page_number": 3, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "5c7163f79e2e74c114c3442ede0e8150", "text": "Details Setup Activities Financials. Framework Risk Indicators. Targets Results. Performance Graphs. Files More Reperting Period Geographic Area Compare With 2023 harkand - Target © submit I v Search Y Show More Fiters PROJECT INDICATOR TARGET ResuLT #of food packets distriouted 100 25 #0f teachers trained on nution ° 250 20 % schools enalled in“end hunger” program 50 smount rased for “end hunger- program 0000 R NR locsl opinion of “end hunger* program nutston expert hired? e o o o Yes —None--\n\nEach Project Indicator is hyperlinked to its record. Clicking on it will open the Project Indicator record in a new tab.\n\nEach Project Indicator also has an Information icon in the Project Indicator column. When you hover over the icon, a pop-over displays the additional information stored on the Project Indicator record. By default, Objectives, Guidelines, Disaggregation Groups, Cross-Disaggregated by Sex, and Calculation Factor are shown.", "metadata": {"page_number": 3, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "7ffb7487193ab7874e800145abd7244b", "text": "There is a Search and Filter box at the top of the table that can be used to find specific Project Indicators to add Results for. Refer to this section if you want to make changes to this interface or filter functionality.\n\nNote: There are numerous ways to define the order of the Project Indicators on this page. Contact your System Administrator if you have specific requirements for the ordering of Project Indicators or visit this page to learn more about Project Indicator ordering.", "metadata": {"page_number": 3, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "b7216618a2608abb0e98932516f9300a", "text": "Compare Results Data with Target or Baseline Data LIGHTNING WEB COMPONENT\n\nThe “Compare With” dropdown allows you to compare Results against either Targets or Baseline values of Project Indicators. The “Compare With” dropdown will only be displayed on the Add Results Lightning Web Component if a Reporting Period for the Baseline is created.\n\nBy default, “Target” is selected in the “Compare With” dropdown. It will load the Add Results table with an additional Target column to the left of the Result column. Target and Result values can then be seen and compared side by side.\n\nDetails Setup Framework Activities Risk Indicators. Targets Results Performance Graphs. Financials Files Resring perod Geograpric Ares Compare win 2022 Austrla Target © submit I3 Searcn Y Show More Fiters PROJECT INDICATOR TARGET ResuLT Number of rsinees 850 &0 Total greennouse gas emissions per year i tonnes 75000 80000", "metadata": {"link_texts": ["Targets", "Baseline"], "link_urls": ["https://verasolutions.atlassian.net/wiki/spaces/AIEP/pages/3732406300/Set+Targets#Lightning-Web-Component-Enter-Target-Values-For-Project-Indicators", "https://verasolutions.atlassian.net/wiki/spaces/AIEP/pages/3732406300/Set+Targets#Lightning-Web-Component-Enter-Baseline-Values-for-Project-Indicators"], "page_number": 4, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "c285bcc991558aca756709fe8d544f75", "text": "Result Values can also be compared against Baseline values. To compare Results against Baseline Values, select the Baseline option in the “Compare With” dropdown and the additional Baseline column will be visible for easy comparison. Only Project Indicators associated with the selected Geographic Area, Reporting Period, and that has the “Has Baseline?” checkbox selected will be displayed on the table.\n\nEar Delete [ itonmental Conservation + Follow (Generate Reporting Perods Actve? Organizaton Funding Amaunt projct Sar Date Projct End Date @ “The Climate Project $1.20000000 2022 1213112023 Details setup Framework Activities Risk Indicators Targets Performance Graphs Financials. Files Reportng Period Gaograptic Avea 2022 Austala © suomit = Search Y Show More Fiters PROJECT INDICATOR BASELINE ResuLT Numoer of treatened species B 50", "metadata": {"page_number": 4, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "adf964f2be1a9ee91e89846a657b2ccf", "text": "Enter Result Values For Project Indicators LIGHTNING WEB COMPONENT\n\nOnce your Project Indicator and related Project data setup are done, you’ve set Targets, and Baseline values, you are ready to start entering Result data. Typically, there are two kinds of Project Indicators to add results for:\n\nNon-Disaggregated Project Indicators\n\nThese are exactly what they say: Project Indicators without disaggregation groups defined. Typically, these are a bit more straight-forward when it comes to data entry and management. Just enter the values in the input field depending on the Data Type of the Indicator.\n\nDisaggregated Project Indicators\n\nThese Project Indicators are either disaggregated by sex or by a disaggregation group or both. It takes a few more clicks when it comes to data entry and management. Be on the lookout of hyperlinks and plus signs as these might point to Project Indicators with Result Value Disaggregations.", "metadata": {"link_texts": ["Non-Disaggregated Project Indicators", "Disaggregated Project Indicators"], "link_urls": ["https://verasolutions.atlassian.net/wiki/spaces/AIEP/pages/3732406327/Add+Results#Enter-Target-Values-and-Comments-for-Non-Disaggregated-Project-Indicators", "https://verasolutions.atlassian.net/wiki/spaces/AIEP/pages/3732406327/Add+Results#Enter-Target-Values-for-Disaggregated-Project-Indicators"], "page_number": 4, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "6afa920804bd3fbc6e0c1dda699bfdfe", "text": "For both disaggregated and non-disaggregated Project Indicators, Result values need to be entered depending on the Data Type of the Indicator. This is defined on the Project Indicator level and summarized in the table below. These Result values are saved in the Result record.", "metadata": {"link_texts": ["Project Indicator level"], "link_urls": ["https://verasolutions.atlassian.net/wiki/spaces/AIEP/pages/3733192705/Create+Manage+Indicators#Set-Up-Target-and-Result-Validation-Ranges"], "page_number": 5, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "2ad6aa2214abcd4210eb7f325365c5b6", "text": "Enter Result Values and Comments for Non-Disaggregated Project Indicators\n\nFor non-disaggregated Project Indicators, Result data is auto-saved for each input field after you enter a value and click out from the data input cell. Enter the Result values next to the relevant Project Indicator for the relevant Reporting Period.\n\nResult data is not deleted by simply removing values from this table. Result data has to be manually deleted from the Results object. Contact your System Administrator if you require support with this.\n\nAdditionally, each Project Indicator row on the table has a comment icon. A comment pop-up is displayed when you click on this icon to add or edit any additional qualitative information about that Result value. Hover over the comment icon to display a preview of the comment after entering its result(s).", "metadata": {"page_number": 5, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "495d655c8ea7a503df9245ef722dd0a0", "text": "Details Setup Activities Financials Framework Risk Indicators Targets Results. Performance Graphs. Files More Repering period Geographic Area Compare itn 2028 Inarkand v Torget © swmit e Search ¥ Show Mo Fiters PROJECT INDICATOR TARGET ResuLT #of food packets distrbuted 00 s o i # of teachers trained on nutiton 10 -\n\nNote: With the Libertas (v1.35) Release, users can add images, links and other rich text in comments since it controlled by a fieldset. Read more about it here.\n\nConmants = L LEEERS b et et —— s", "metadata": {"link_texts": ["here. "], "link_urls": ["https://verasolutions.atlassian.net/wiki/spaces/AIEP/pages/3694526491/Add+Results+Customization+Options#Configurable-Comment-Pop-Up--Lightning-Web-Component-LIBertas-v1.35-onwards"], "page_number": 6, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "10656acdb6df14e25fe967fa36bec244", "text": "Enter Result Values for Disaggregated Project Indicators\n\nThere are a few clicks to enter disaggregated Result values for a particular Reporting Period:\n\nClick on the plus (+) icon displayed.\n\nResertng Perod Geographic Area Compare with 2028 nda Targot © sumit <] v ¥ Show More Fiters 0JECT INDICATOR TARGET REsuLT Adopion of Sustainable Living Practses 100 % Numbar of attendeos in plantaton drive 500\n\nA pop-up will appear where the number and format of input fields vary based on the “Data Type”, “Disaggregation Group”, “Cross-Disaggregated By Sex?”, and the “Calculate Total” fields. The pop-up header displays the “Indicator Definition” field, selected Geographic Area, and the Reporting Period for which Results are being entered in that order. To see more details about a Project Indicator, simply hover over the information icon.", "metadata": {"page_number": 6, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "095e8931052c7abaf5742c62a2af7379", "text": "Related Information Adoption of Sustainable Living Practises - India - 2023 @ Objective(s) © Resuits entered in this popup will save orly when the Save button is clicked Guideline: Disaggregation Group: Generations SEX DISAGGREGATION Cross-Disaggregation by Sex true Summary Value Female TARGET RESULT TARGET RESULT TARGET 100 % B% 58% GenX ) 0% 5% 20% GENERATIONS GenY 40% 0% 8% Genz 2% 10% 0%\n\nIn the pop-up, the input field formats for each Data Type are followed. The display of the popup varies depending on the values of the following fields: “Calculate Total”, “Disaggregation Group” and “Cross Disaggregation By Sex”. Navigate to this page to learn more.\n\nScroll horizontally or vertically within the pop to view all input fields.\n\nEnter the Results in the pop-up. Result data entered in the pop-up will only be saved when the “Save” button is clicked.\n\nOnce Results have been added, the plus (+) icon will either be replaced by", "metadata": {"link_texts": ["Data Type", "page"], "link_urls": ["https://verasolutions.atlassian.net/wiki/spaces/AIEP/pages/edit-v2/3732406327#Data-Type", "https://verasolutions.atlassian.net/wiki/spaces/AIEP/pages/3694526491/Add+Results+Customization+Options#For-Quantitative-Indicators%2C-where-Calculate-Total-is-set-to-Don%E2%80%99t-Sum-Total"], "page_number": 7, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "ff4617dbca7a8e31f0b01967e0b0b402", "text": "A hyperlinked numerical value (for Quantitative Indicators that have Calculate Total set to Sum Total), or\n\nA pencil icon (for all Qualitative Indicators and those Quantitative Indicators that have Calculate Total equal to Don’t Sum Total).\n\nIn the case of Numerator/Denominator Indicators with Calculate Total set to Sum Total, the Summary Value is populated after performing the following calculation: (Sum of all numerators / Sum of all denominators) x Calculation Factor.\n\nThe Calculation Factor is also mentioned in the modal from Nashira (v1.38) release onwards.\n\nIf Result values have been added for a Project Indicator, the “Dissaggregation Group” field cannot be edited. We do not recommend editing the “Cross-Disaggregation by Sex” field after adding Results for a Project Indicator as it may cause the Add Results LWC to malfunction.\n\nFor disaggregated Project Indicators, the comment icons will be shown inside the Disaggregation pop-up.", "metadata": {"page_number": 7, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "4e9362792ebf1dffaa47ef5f4d02b689", "text": "For Project Indicators that are Disaggregated by Sex, one comment icon is entered across the Male, Female, and Unknown Targets.\n\nNumber of students - Gujarat - December 2023 © 10 Trgets enerdin i popup it save arly when the Save buttonis cicked SEX DISAGOREGATION Total Male Female Unknown o0 500 00 2\n\nFor Project Indicators that are Disaggregated by Group, one Comment can be entered for each Disaggregated value in the group.\n\nDisag group by animals - village - 2024 © © Targos entered intis popup willsave only when the Save button s clcked Land animals - ANIMALS Water animals -\n\nClick on the comment icon to display or add new comments. Hovering over the Comment icon displays a preview of the saved comment.", "metadata": {"page_number": 8, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "c2909ceaa5c97cc20046fc833f26dcfb", "text": "Mark Results as Not Applicable LIGHTNING WEB COMPONENT\n\nOccasionally, Results cannot be reported due to irrelevance or extenuating circumstances. In these cases, Results can be marked as “Not Applicable” in the comment pop-up. This will update\n\na field on the Result record so that not-applicable Results can be filtered out of any reports or dashboards.\n\nComments. o ey n\n\nDetails Framework Activities Risk Indicators Results. Financials Files Setup Targets Performance Graphs Reparting Priod Geographic Area Compare Wit 202 Australia v Target © sumit 5] o Y Show More Fiters PROJECT INDICATOR TARGET ResuLT Indesx of cosstal eutrophis ton 0 L« 1", "metadata": {"page_number": 8, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "308c0b7ae4be491899551ede943610d6", "text": "Indicator Performance Stoplights LIGHTNING WEB COMPONENT\n\nStoplight icons allow users to view Results’ performance compared to Targets at a glance on the Add Result table. Refer to this section to know more about setting them up. These icons can only be used if Targets are set for the specific Project Indicator.\n\nHere is what is looks like for non-disaggregated Project Indicators:\n\n“ [P E———— [P ———— m [Per— e sowvaiom oarove mvonsos 1 [ )| DD = ] (2 ) = o [er—— P ——— == LT — s soea\n\nHere is what it looks like for disaggregated Project Indicators:\n\nNumber of volunteers rained to pravide eary interventin - India - Jan - May © 2020 [ Pp— ot sesar s nesur ot o ” \" o u tocaury ™ \" B w P n \" \" § = - |\n\nNote: Numerator/Denominator type Indicators do not support Stoplights in the Mira (V1.37) release. It is supported from Nashira (V1.38) release onwards.", "metadata": {"link_texts": ["this section"], "link_urls": ["https://verasolutions.atlassian.net/wiki/spaces/AIEP/pages/3733192705/Create+Manage+Indicators#Set-Up-Indicator-Performance-Stoplights-LIGHTNING-WEB-COMPONENT"], "page_number": 9, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "e571aae9f10da03d1a75ee703a189967", "text": "Upload Documents LIGHTNING WEB COMPONENT\n\nUsers can upload relevant documents for reported Results by attaching them to the selecting Reporting Periods.\n\nClick on the action icon on the top right of the page to see the “Attach Files” option.\n\nDetails Setup. Framework Activities Risk Indicators. Targets Results Performance Graphs Financials. Files. ARVF Reportng Period Geographic Area Compare with 12022 Austeaia Targets © submit ] v Search Y Show More Fiters Download Resuts Uplosd Results i PROJECT INDICATOR TARGETS % of partcipants 90%\n\nThis will bring up a pop-up that will prompt you to upload documents:\n\nUpload Documents for Reporting Period Q1 2022 7o plond dcumants), ik o th Upiond i bt s sk e s 1o vt s ey & upsaries ot ties T owner u ModiiedDate seton e [ oz s\n\nThe pop-up header displays the selected Reporting Period\n\nTypically, the list of required documents is added to the pop-up to specify which documents are required.", "metadata": {"page_number": 10, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "bccda00f155875ed2d076e742433051f", "text": "The list of documents already uploaded is added to the pop-up.\n\nThese documents can be edited/updated versions can be uploaded using the Edit icon next to them in the table.\n\nUsers can also delete the documents by clicking on the Delete icon next to them.\n\nClick on the “Upload Files” button to select the files or drop files directly in the drop zone to upload them.", "metadata": {"page_number": 10, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "82782baed8367fd45560104f8eae2b81", "text": "Submit Results for Review LIGHTNING WEB COMPONENT\n\nSome organizations have a process in place to submit, review, and lock Result data for editing once it is approved. If this feature is enabled, the “Submit” button can be used to lock the Results.\n\nClick the “Submit “button and confirm the submission.\n\nDetails Setup Framework Activities Risk Indicators Targets Results Performance Graphs Financials Files ARVF Reporting period Geographic Area Compare with - 12022 Australia Torgets S Y Show More Flters\n\nSubmit Are you sure you want to submit Results for this Reporting Period?\n\nOnce the Users confirm by clicking on the Confirm button, the Results in the Add Results table are locked for the selected Reporting Period.\n\nThe “Upload” button is also greyed out to prevent any additional Results from being uploaded.", "metadata": {"page_number": 11, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "e621382ce1824ec281f097496850915d", "text": "Disaggregated result data or qualitative targets can still be viewed by clicking on the hyperlinked total value or eye icon, which will open a read-only version of the disaggregated data entry popup.\n\nReperting Period Goographic Area Compare Wi Dec2022 v India Targer Y Show More Fiters PROJECT INDICATOR TARGET RESULT Total Money Spent per gender 187 148 Total Money Spent in this year w“ a2m Total Money Spent for the group. 13 Total Money Spent 200 89400 § Qualtative Feedback SUMMARY NOT AVAILABLE\n\nWhen Results /Reporting Periods are submitted and locked via the “Submit and Lock Wizard” users will see the same interface as mentioned above. This Wizard is available from Mira Release (v1.37) onwards\n\nSystem Admin Note: When the “Override Locked Results” custom permission is assigned to a user they can make edits to results even if they have been submitted or the Add Results LWC has been locked. Read more here.", "metadata": {"link_texts": [" here."], "link_urls": ["https://verasolutions.atlassian.net/wiki/spaces/AIEP/pages/3694526491/Add+Results+Customization+Options#Add-Results%3A-Custom-Permissions-Nashira-v1.38-onwards"], "page_number": 11, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "88088f84c2bc321a6f7747a92996b842", "text": "Multiple Users Making Updates Simultaneously: Refresh the Add Results Component LIGHTNING WEB COMPONENT\n\nOften, there are a number of users in the system, entering and managing data simultaneously. If another user makes and saves updates on a component or a related component (like the Framework or Project Indicators) while you’re working in the system, you’ll see a notification that alerts you that changes have been made. Click on the “Refresh” icon to load and reflect the latest data on the Add Results component along with all the Results that have been previously recorded. For example, if the Project Indicator Definition is edited or a Geographic Area is marked Inactive, these changes will be reflected once the Add Results component is refreshed.", "metadata": {"page_number": 12, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "4da2f1736ef1c68deaef3a36b2181485", "text": "Det: Setup Framework Activities Risk Indicators Targets. Results Performance Graphs Financials Files. Reporting Peiod Geographic Area v 2023 India © submit Search ¥ Show More Fiters PROJECT INDICATOR TARGET REsuLT 200 uso 200 Costs of raining on waste management Number of tree lantation drives 500 480 Percent of scrap metal recycled 0 a3", "metadata": {"page_number": 12, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "ed5b7c77a8030a98850db3e151fcffd4", "text": "Add Results for Project Indicators using the Visualforce Page VISUALFORCE PAGE\n\nBefore you can add Results for your Project Indicators, there are a couple of Project setup-related tasks to complete:\n\nSet project-specific Reporting Periods\n\nCreate Geographic Area records\n\nSet up Project Indicators\n\nIf any of these elements are missing, you’ll get a message saying: “The Project is not linked to at least one Project Indicator for a Reporting Period and Geographic Area.”\n\nHere is a screenshot of what you’ll see if the data setup is done correctly:\n\nOwals Sep Framework Actiios Idestos Torges Results Fiancils Submission Response e pr—— - 020 0 s o] - ¥ st srosermorearon raacer arsur — TS ———— Mo ek st sty vt", "metadata": {"link_texts": ["Set project-specific Reporting Periods", "Create Geographic Area records"], "link_urls": ["file:///C:\\wiki\\spaces\\AIEP\\pages\\3653763073\\Reporting+Periods+Create+Assign+Reporting+Periods+for+your+Project", "file:///C:\\wiki\\spaces\\AIEP\\pages\\3678011393\\Project+Geographic+Areas+Assign+Geographic+Areas+to+your+Project"], "page_number": 12, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "a7367d698f8056f8c9eec4947acad896", "text": "Select a “Reporting Period” that you want to enter Result values for from the dropdown. Only Reporting Periods that are related to Project Indicators will be displayed in this list. The first Reporting Period is selected by default so remember to check and update the Reporting Period value if you’re adding Results for another period.\n\nNote: A default Result Reporting Period can be selected for the Project which controls the Reporting Period displayed on the filter above when any user first navigates to the Add Results page. Deactivated Reporting Periods will be displayed on the Add Results Visualforce page.", "metadata": {"page_number": 13, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "c2e4d5879b2fe418e134a460863cb3c5", "text": "2. Select a “Geographic Area” that you want to enter Target values for. Only Geographic Areas that are marked as “Active” will be available. Results can only be set for one location at a time. The first value in the list of Geographic Areas is selected by default so remember to check and update the Geographic Area value if you’re setting Results for another area. 3. The list of available Project Indicators that are related to the selected Reporting Periods and Geographic Areas will be displayed in the Add Results table. By default, the Project Indicator Definition (or the translated value if applicable) is displayed on the left side of the table. 4. Each Project Indicator also has an information icon in the Project Indicator column. When you hover over the icon, a pop-over displays the additional information stored on the Project Indicator record. 5. Each Project Indicator row has a comments icon. When clicked, a comments pop-up window displays to track any notes/guidelines the user wants to track. These are", "metadata": {"link_texts": ["this section"], "link_urls": ["https://verasolutions.atlassian.net/wiki/spaces/AIEP/pages/3698032694/AddResults+Lightning+Web+Component+Customization+Options#Search-Bar-and-Filter-Customization"], "page_number": 13, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "4bbd69551793335b48efa347c750fa1b", "text": "icon. When clicked, a comments pop-up window displays to track any notes/guidelines the user wants to track. These are saved to the comments field on the Result object. 6. There is a Search and Filter box at the top of the table that can be used to find specific Project Indicators to set Results for. Refer to this section if you want to make changes to this interface or filter functionality.", "metadata": {"link_texts": ["this section"], "link_urls": ["https://verasolutions.atlassian.net/wiki/spaces/AIEP/pages/3698032694/AddResults+Lightning+Web+Component+Customization+Options#Search-Bar-and-Filter-Customization"], "page_number": 13, "is_continuation": true, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "fdc0a0c150f980d7ef1bfcc8ca45153f", "text": "Note: There are numerous ways to define the order of the Project Indicators on this page. Contact your System Administrator if you have specific requirements for the ordering of Project Indicators or visit this page to learn more about Project Indicator ordering.", "metadata": {"link_texts": ["this page"], "link_urls": ["https://verasolutions.atlassian.net/wiki/spaces/AIEP/pages/3698032694/AddResults+Lightning+Web+Component+Customization+Options#Project-Indicator-Order"], "page_number": 13, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "bd8a809a18651a2b9fa42dab88525f86", "text": "Enter Result Values For Project Indicators VISUALFORCE PAGE\n\nOnce your Project Indicator and related Project data setup are done, you’re ready to start adding Results. Typically, there are two kinds of Project Indicators to set targets for:\n\nNon-Disaggregated Project Indicators\n\nThese are exactly what they say: Project Indicators without disaggregation groups defined. Typically, these are a bit more straight-forward when it comes to data entry and management.\n\nDisaggregated Project Indicators\n\nThese Project Indicators are either disaggregated by sex or by a disaggregation group or both. You’ll be able to see data entry options either in the disaggregation by sex columns or the additional disaggregation groups rows.\n\nFor both disaggregated and non-disaggregated Project Indicators, result values need to be entered depending on the Data Type of the Indicator. This is defined on the Project Indicator level and summarized in the table below. These values are saved in the Result record.", "metadata": {"link_texts": ["Project Indicator level"], "link_urls": ["https://verasolutions.atlassian.net/wiki/spaces/AIEP/pages/3733192705/Create+Manage+Indicators#Set-Up-Target-and-Result-Validation-Ranges"], "page_number": 13, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "43a63822410fad95367812666da8f5ed", "text": "If the Result value is disaggregated, the Disaggregation Groups will be displayed below that Project Indicator and you’ll have the option to enter Result values for each of the Disaggregation Groups.\n\nSROJKCT INDICATOR o T o = U —— 10000050 ssomoouso 00000050 ssomoouso = Bomoouso 00000 o 1000000 somo0 o 045 000 00000 o w0000 200000 o s “som00us0 1500000 o 1500000 1500000 o 3 1500000u50. 300000 o 00000 so0000 o [R———— 2100000 700000 70000 7000 J——\n\nConsider the following when entering Result values:\n\nResult data is auto-saved for each input field after the user enters a value and clicks out from the data input cell.\n\nResult data is not deleted by simply removing values from this table. Result data has to be manually deleted from the Results object. Contact your System Administrator if you require support with this.", "metadata": {"page_number": 14, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "205f9cf09753c0b031690df7b70e128f", "text": "Indicator Performance Stoplights VISUALFORCE PAGE\n\nStoplight icons allow users to view Results’ performance compared to Targets at a glance on the Add Result table. Refer to this section to know more about setting them up. These icons can only be used if Targets are set for the specific Project Indicator.\n\nHere is what is looks like:\n\nPROJECT INDICATOR TOTAL TARGET RESULT > Amount deposited by Area Type 533 310 L Amount deposited into savings accounts 225,500 KES 290,000 KES @ Assessments given 2,590 1085 X Change in consumer behavior observed Change in Savings 1250 UsD 2345 usD Conversion rate 70% 90 )", "metadata": {"link_texts": ["this section"], "link_urls": ["https://verasolutions.atlassian.net/wiki/spaces/AIEP/pages/3733192705/Create+Manage+Indicators#Set-Up-Indicator-Performance-Stoplights-LIGHTNING-WEB-COMPONENT"], "page_number": 14, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "b1486a0d1c5e9a2f31245c20b8d63f2f", "text": "Upload Documents VISUALFORCE PAGE\n\nWhen the Attach button is clicked, the Upload Document pop-up window displays for the currently selected Reporting Period. The window displays:\n\nAny rich text data entered in the Documents_Required_for_RP__c field on Reporting_Period__c object. This allows organizations to specify the list of documents they want or recommend users to upload to support the data they have reported.\n\nInterface to choose a file to upload and upload button.\n\nA table listing the documents uploaded, with owner and date details. These documents can be edited/updated versions can be uploaded using the Edit icon.", "metadata": {"page_number": 15, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "5b647e436e7667081c388f07518c9a57", "text": "Upload Documents for Reporting Period 2017 Documents Required for this Reporting Period: 1 ancial report, including detailed PBL statement 2. Review of the internal social accountal ty framework 3. Meeting notes from the latest performance management review o upload a document, click on the “Choose File\" button, choose the file you want to attach and then click on the “Upload” button. Repeat these steps to upload multiple documents, Choose File | No file chosen &, Upload Title Owner Last Modified Date Action\n\nThrough the Amp Impact Admin custom setting, an organization can choose to enable/disable the Upload Documents feature. This feature allows users to upload documents supporting the Results data they have entered for the specific Reporting Period.", "metadata": {"page_number": 15, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}, {"type": "CompositeElement", "element_id": "09eec4799b95d8d9d37c22c867a3801d", "text": "Submit Result for Review VISUALFORCE PAGE\n\nSome organizations have a process in place to submit, review, and lock Result data for editing once it is approved. If this feature is enabled, the “Submit” button can be used to lock the Results.\n\nSet Targets J- ShouFesd Reporting Period Geographic Area Annual 2018 India I3 B Enter Search Text\n\nConfirm You are submitting the data for all indicators reported on for review. Do you wish to continue? Cancel\n\nThrough the Amp Impact Admin custom setting, an organization can choose to enable/disable the Submit Results feature.", "metadata": {"page_number": 16, "languages": ["eng"], "filename": "Add+Results (3).docx", "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"}}]